models/deepseek-v2-lite-2p2d/benchmark_results/p50_2p2d_20260318_003022/warmup.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7834afd6d300>, seed=7, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=7870, random_output_len=252, random_range_ratio=0.0, random_prefix_len=6000, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url=None, host='localhost', port=9000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/workspace/models/deepseek-v2-lite', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=5.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/workspace/benchmark_results/p50_2p2d_20260318_003022', result_filename='warmup_discard.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-788461c2-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 03-18 00:30:42 [datasets.py:611] Sampling input_len from [7869, 7869] and output_len from [252, 252]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 5.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 100/100 [00:31<00:00,  3.13it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Request rate configured (RPS):           5.00      
Benchmark duration (s):                  31.94     
Total input tokens:                      1386900   
Total generated tokens:                  25200     
Request throughput (req/s):              3.13      
Output token throughput (tok/s):         788.88    
Peak output token throughput (tok/s):    1179.00   
Peak concurrent requests:                64.00     
Total token throughput (tok/s):          44205.39  
---------------Time to First Token----------------
Mean TTFT (ms):                          2530.30   
Median TTFT (ms):                        2640.61   
P50 TTFT (ms):                           2640.61   
P90 TTFT (ms):                           3699.31   
P95 TTFT (ms):                           3983.50   
P99 TTFT (ms):                           4357.64   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          36.64     
Median TPOT (ms):                        36.51     
P50 TPOT (ms):                           36.51     
P90 TPOT (ms):                           37.03     
P95 TPOT (ms):                           37.09     
P99 TPOT (ms):                           38.20     
---------------Inter-token Latency----------------
Mean ITL (ms):                           36.64     
Median ITL (ms):                         36.30     
P50 ITL (ms):                            36.30     
P90 ITL (ms):                            38.39     
P95 ITL (ms):                            39.69     
P99 ITL (ms):                            42.93     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          11726.69  
Median E2EL (ms):                        11848.14  
P50 E2EL (ms):                           11848.14  
P90 E2EL (ms):                           12872.44  
P95 E2EL (ms):                           13141.30  
P99 E2EL (ms):                           13518.78  
==================================================